{ "posts":[{
  "id": 1,
  "user": "CatsAreDaBestMeow92",
  "userTime": "3 Months",
  "catPic": "http://www.catcraze.com/images/listings/501a170bf1155eefbafcc6d2a8bf111c.jpg",
  "title": "Look at This Cutie",
  "message": "Exotic Shorthairs are super-cute omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh omigosh.",
  "awards": 1,
  "tldr": "Exotic Shorthairs are cute."

}, {
  "id": 2,
  "user": "MyOtherHoodieHasEars",
  "userTime": "1 Year",
  "catPic": "https://s3.graphiq.com/sites/default/files/585/media/images/t2/Exotic_Shorthair_5581147.jpg",
  "title": "My moms cat",
  "message": "This is my mom's cat. His name is Fred, but we call him UFO, because his eyes remind us of aliens. His past-times include: stealing food straight off of my plate and staring out the window like a crazy person.",
  "awards": 3,
  "tldr": "My mom's cat UFO is a food thief."

}, {
  "id": 3,
  "user": "ExoticBreeder3",
  "userTime": "4 Years",
  "catPic": "http://i.dailymail.co.uk/i/pix/2013/09/23/article-2430119-1834AA6700000578-423_634x424.jpg",
  "title": "Kitten for sale",
  "message": "Hello, my name is Sharron, and I am an Exotic breeder located in Eugene, OR. We just had our beauiful Exotic Mindy give birth to 6 cute kittens! Here, is a picture of one of them. This is Spots. Spots is a male calico, and will be up for adoption in July. Comment below if interested!",
  "awards": 1,
  "tldr": "Male calico for sale in Oregon! Comment for details!"

}, {
  "id": 4,
  "user": "IheartSnoopy4Ever",
  "userTime": "2 Days",
  "catPic": "https://s-media-cache-ak0.pinimg.com/236x/75/22/17/752217532e4d3f9ae98ce5750d600e3f.jpg",
  "title": "Another pic of Snoopy!",
  "message": "Snoopy is my favorite famous internet cat. I just can't get enough of him!",
  "awards": 1,
  "tldr": "Snoopy love!"

  }],
  "comments": [{
  "commentUser": "CatsCatsCats",
  "commentMessage": "Throwup on your pillow attack dog, run away and pretend to be victim. Throwup on your pillow loves cheeseburgers, yet if it fits, i sits or jump launch to pounce upon little yarn mouse, bare fangs at toy run hide in litter box until treats are fed so cats go for world domination so eat prawns daintily with a claw then lick paws clean wash down prawns with a lap of carnation milk then retire to the warmest spot on the couch to claw at the fabric before taking a catnap."

  }, {
  "commentUser": "CatIpsumBestIpsum",
  "commentMessage": "Destroy the blinds spit up on light gray carpet instead of adjacent linoleum hate dog walk on car leaving trail of paw prints on hood and windshield. Damn that dog chase ball of string but stare at ceiling light for cough furball, so walk on car leaving trail of paw prints on hood and windshield but if it fits, i sits. Lick arm hair."

  }]
}
